"""
Цей код розв'язує систему лінійних рівнянь з трьома діагоналями за допомогою методу прогонки.
Вхідні дані - це матриця коефіцієнтів системи та вектор вільних членів.
Вихід - вектор невідомих змінних, який задовольняє дану систему рівнянь.
Основна ідея методу полягає в зведенні вихідної матриці до тридіагональної форми, після чого шукаються прямий та зворотній хід методу.
"""
def tridiagonal_alg(matrix, vector):
    n = len(matrix)
    c = [0] * n
    d = [0] * n
    x = [0] * n
    c[0] = matrix[0][1] / matrix[0][0]
    d[0] = vector[0] / matrix[0][0]

    for i in range(1, n - 1):
        c[i] = matrix[i][i+1] / (matrix[i][i] - matrix[i-1][i] * c[i-1])
        d[i] = (vector[i] - matrix[i-1][i] * d[i-1]) / (matrix[i][i] - matrix[i-1][i] * c[i-1])

    d[n-1] = (vector[n-1] - matrix[n-2][n-1] * d[n-2]) / (matrix[n-1][n-1] - matrix[n-2][n-1] * c[n-2])
    x[n-1] = d[n-1]

    for i in range(n-2, -1, -1):
        x[i] = d[i] - c[i] * x[i+1]

    return x

test_matr = [    [4.990, 1.420, 0.000, 0.000, 0.000],
    [1.470, 4.960, 1.720, 0.000, 0.000],
    [0.000, 1.130, 4.530, 1.060, 0.000],
    [0.000, 0.000, 1.930, 4.180, 1.020],
    [0.000, 0.000, 0.000, 1.600, 4.880]
]
test_b = [9.980, 4.660, 5.590, 7.130, 6.480]

print(tridiagonal_alg(test_matr, test_b))
